app/views/bars/show.html.erb


<% if @reviews.any? { |review| review.user.admin == true } %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 15], ["LIMIT", 1]]