app/controllers/api/v1/bars_controller.rb

  def index
    render json: Bar.order(:rating)
---
SELECT "bars".* FROM "bars" ORDER BY "bars"."rating" DESC