app/controllers/bars_controller.rb

SELECT "bars".* FROM "bars" WHERE (lower(name) LIKE '%oscars%' OR lower(name) LIKE '%oscar''s%' OR lower(name) LIKE '%o''scars%' OR lower(address) LIKE '%oscars%' OR lower(city) LIKE '%oscars%' OR zip LIKE '%oscars%')
---
  def index
    @bars = Bar.search(params[:term])

SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 4]]
---
  def show
    @bar = Bar.find(params[:id])
    @reviews = @bar.reviews
    @votes
    admin_review = @reviews.select { |review| review.user.admin == true }