app/controllers/reviews_controller.rb

  def new
    @bar = Bar.find(params[:bar_id])
    if current_user.reviews[0]
      can_review = true
      current_user.reviews.each do |review|
        if review.bar_id == @bar.id
          can_review = false
        end
      end
      reviews = @bar.reviews.all
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 5]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."bar_id" = $1  [["bar_id", 18]]

  def create
    @bar = Bar.find(params[:bar_id])
    @review = @bar.reviews.new(reviews_params)
    @review.user = current_user
    if @review.save
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "reviews" ("drinks", "food", "entertainment", "vibe", "setting", "description", "user_id", "bar_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @bar = Bar.find(params[:bar_id])
---
SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def update
    @review = Review.find(params[:id])
    @review.assign_attributes(reviews_params)
    @bar = @review.bar
    if @review.save
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "description" = $1 WHERE "reviews"."id" = $2  [["description", "Rock and roll baby this place is mayhem! rootin tootin scootin beer slammin' bar slappin' fun you son of a gun like none I've ever has before!"], ["id", 1]]

  def destroy
    @review = Review.find(params[:id])
    @bar = @review.bar
    @review.delete
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 19]]